RT-Thread/rt-thread/bsp/at32/at32f403a-start/board/msp/system_at32f4xx.c
/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2021-04-13     shelton      first version
 */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup at32f4xx_system
  * @{
  */

/** @addtogroup at32f4xx_System_Private_Includes
  * @{
  */

#include "at32f4xx.h"

/**
  * @}
  */

/** @addtogroup at32f4xx_System_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @addtogroup at32f4xx_System_Private_Defines
  * @{
  */

/*!< Uncomment the line corresponding to the desired System clock (SYSCLK)
   frequency (after reset the HSI is used as SYSCLK source)

   IMPORTANT NOTE:
   ==============
   1. After each device reset the HSI is used as System clock source.

   2. Please make sure that the selected System clock doesn't exceed your device's
      maximum frequency.

   3. If none of the define below is enabled, the HSI is used as System clock
    source.

   4. The System clock configuration functions provided within this file assume that:
        - For at32f4xx devices, an external 8MHz crystal is used to drive the System clock.
     If you are using different crystal you have to adapt those functions accordingly.

      Clock (MHz)
          PLL from HSE or HSI
          SYSCLK        HCLK    PCLK2   PCLK1
          24            24      24      24
          36            36      36      36
          48            48      48      24
          56            56      56      28
          72            72      72      36
          96            96      48      48
          108           108     54      54
          120           120     60      60
          144           144     72      72
          150           150     75      75
          168           168     84      84
          176           176     88      88
          192           192     96      96
          200           200     100     100
          224           224     112     112
          240           240     120     120
    */

#if defined (AT32F403xx) || defined (AT32F413xx) || \
    defined (AT32F415xx) || defined (AT32F403Axx)|| \
    defined (AT32F407xx)
/* #define SYSCLK_FREQ_HSE          HSE_VALUE */
/* #define SYSCLK_FREQ_24MHz        24000000 */
/* #define SYSCLK_FREQ_36MHz        36000000 */
/* #define SYSCLK_FREQ_48MHz        48000000 */
/* #define SYSCLK_FREQ_56MHz        56000000 */
/* #define SYSCLK_FREQ_72MHz        72000000 */
/* #define SYSCLK_FREQ_96MHz        96000000 */
/* #define SYSCLK_FREQ_108MHz       108000000 */
/* #define SYSCLK_FREQ_120MHz       120000000 */
/* #define SYSCLK_FREQ_144MHz       144000000 */
/* #define SYSCLK_FREQ_24MHz_HSI    24000000 */
/* #define SYSCLK_FREQ_36MHz_HSI    36000000 */
/* #define SYSCLK_FREQ_48MHz_HSI    48000000 */
/* #define SYSCLK_FREQ_56MHz_HSI    56000000 */
/* #define SYSCLK_FREQ_72MHz_HSI    72000000 */
/* #define SYSCLK_FREQ_96MHz_HSI    96000000 */
/* #define SYSCLK_FREQ_108MHz_HSI   108000000 */
/* #define SYSCLK_FREQ_120MHz_HSI   120000000 */
/* #define SYSCLK_FREQ_144MHz_HSI   144000000 */
#endif

#if defined (AT32F415xx)
/* #define SYSCLK_FREQ_150MHz       150000000 */
/* #define SYSCLK_FREQ_150MHz_HSI   150000000 */
#endif

#if defined (AT32F403xx) || defined (AT32F413xx) || \
    defined (AT32F403Axx)|| defined (AT32F407xx)
/* #define SYSCLK_FREQ_168MHz       168000000 */
/* #define SYSCLK_FREQ_176MHz       176000000 */
/* #define SYSCLK_FREQ_192MHz       192000000 */
/* #define SYSCLK_FREQ_200MHz       200000000 */
/* #define SYSCLK_FREQ_168MHz_HSI   168000000 */
/* #define SYSCLK_FREQ_176MHz_HSI   176000000 */
/* #define SYSCLK_FREQ_192MHz_HSI   192000000 */
/* #define SYSCLK_FREQ_200MHz_HSI   200000000 */
#endif

#if defined (AT32F403Axx)|| defined (AT32F407xx)
/* #define SYSCLK_FREQ_224MHz       224000000 */
#define SYSCLK_FREQ_240MHz       240000000
/* #define SYSCLK_FREQ_224MHz_HSI   224000000 */
/* #define SYSCLK_FREQ_240MHz_HSI   240000000 */
#endif

/*!< Uncomment the following line if you need to use external SRAM mounted
     (AT32 High density and XL-density devices) as data memory */

/* #define DATA_IN_ExtSRAM */

/*!< Uncomment the following line if you need to relocate your vector Table in
     Internal SRAM. */
/* #define VECT_TAB_SRAM */
#define VECT_TAB_OFFSET  0x0 /*!< Vector Table base offset field.
This value must be a multiple of 0x200. */


/**
  * @}
  */

/** @addtogroup at32f4xx_System_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @addtogroup at32f4xx_System_Private_Variables
  * @{
  */

/*******************************************************************************
*  Clock Definitions
*******************************************************************************/
#ifdef SYSCLK_FREQ_HSE
uint32_t SystemCoreClock         = SYSCLK_FREQ_HSE;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_24MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_24MHz;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_36MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_36MHz;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_48MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_48MHz;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_56MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_56MHz;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_72MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_72MHz;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_96MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_96MHz;        /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_108MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_108MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_120MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_120MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_144MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_144MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_150MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_150MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_168MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_168MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_176MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_176MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_192MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_192MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_200MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_200MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_224MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_224MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_240MHz
uint32_t SystemCoreClock         = SYSCLK_FREQ_240MHz;       /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_24MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_24MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_36MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_36MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_48MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_48MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_56MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_56MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_72MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_72MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_96MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_96MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_108MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_108MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_120MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_120MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_144MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_144MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_150MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_150MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_168MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_168MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_176MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_176MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_192MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_192MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_200MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_200MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_224MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_224MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#elif defined SYSCLK_FREQ_240MHz_HSI
uint32_t SystemCoreClock         = SYSCLK_FREQ_240MHz_HSI;    /*!< System Clock Frequency (Core Clock) */
#else /*!< HSI Selected as System Clock source */
#define SYSCLK_FREQ_HSI            HSI_VALUE
uint32_t SystemCoreClock         = HSI_VALUE;        /*!< System Clock Frequency (Core Clock) */
#endif

__I uint8_t AHBPscTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
/**
  * @}
  */

/** @addtogroup at32f4xx_System_Private_FunctionPrototypes
  * @{
  */

static void SetSysClock(void);

#ifdef SYSCLK_FREQ_HSE
static void SetSysClockToHSE(void);
#elif defined SYSCLK_FREQ_24MHz
static void SetSysClockTo24M(void);
#elif defined SYSCLK_FREQ_36MHz
static void SetSysClockTo36M(void);
#elif defined SYSCLK_FREQ_48MHz
static void SetSysClockTo48M(void);
#elif defined SYSCLK_FREQ_56MHz
static void SetSysClockTo56M(void);
#elif defined SYSCLK_FREQ_72MHz
static void SetSysClockTo72M(void);
#elif defined SYSCLK_FREQ_96MHz
static void SetSysClockTo96M(void);
#elif defined SYSCLK_FREQ_108MHz
static void SetSysClockTo108M(void);
#elif defined SYSCLK_FREQ_120MHz
static void SetSysClockTo120M(void);
#elif defined SYSCLK_FREQ_144MHz
static void SetSysClockTo144M(void);
#elif defined SYSCLK_FREQ_150MHz
static void SetSysClockTo150M(void);
#elif defined SYSCLK_FREQ_168MHz
static void SetSysClockTo168M(void);
#elif defined SYSCLK_FREQ_176MHz
static void SetSysClockTo176M(void);
#elif defined SYSCLK_FREQ_192MHz
static void SetSysClockTo192M(void);
#elif defined SYSCLK_FREQ_200MHz
static void SetSysClockTo200M(void);
#elif defined SYSCLK_FREQ_224MHz
static void SetSysClockTo224M(void);
#elif defined SYSCLK_FREQ_240MHz
static void SetSysClockTo240M(void);
#elif defined SYSCLK_FREQ_24MHz_HSI
static void SetSysClockTo24MHSI(void);
#elif defined SYSCLK_FREQ_36MHz_HSI
static void SetSysClockTo36MHSI(void);
#elif defined SYSCLK_FREQ_48MHz_HSI
static void SetSysClockTo48MHSI(void);
#elif defined SYSCLK_FREQ_56MHz_HSI
static void SetSysClockTo56MHSI(void);
#elif defined SYSCLK_FREQ_72MHz_HSI
static void SetSysClockTo72MHSI(void);
#elif defined SYSCLK_FREQ_96MHz_HSI
static void SetSysClockTo96MHSI(void);
#elif defined SYSCLK_FREQ_108MHz_HSI
static void SetSysClockTo108MHSI(void);
#elif defined SYSCLK_FREQ_120MHz_HSI
static void SetSysClockTo120MHSI(void);
#elif defined SYSCLK_FREQ_144MHz_HSI
static void SetSysClockTo144MHSI(void);
#elif defined SYSCLK_FREQ_150MHz_HSI
static void SetSysClockTo150MHSI(void);
#elif defined SYSCLK_FREQ_168MHz_HSI
static void SetSysClockTo168MHSI(void);
#elif defined SYSCLK_FREQ_176MHz_HSI
static void SetSysClockTo176MHSI(void);
#elif defined SYSCLK_FREQ_192MHz_HSI
static void SetSysClockTo192MHSI(void);
#elif defined SYSCLK_FREQ_200MHz_HSI
static void SetSysClockTo200MHSI(void);
#elif defined SYSCLK_FREQ_224MHz_HSI
static void SetSysClockTo224MHSI(void);
#elif defined SYSCLK_FREQ_240MHz_HSI
static void SetSysClockTo240MHSI(void);
#endif

